/*
Быстрая сортировка / Quicksort

Выберем некоторый опорный элемент. После этого перекинем все элементы, меньшие его, налево, а большие – направо.
Рекурсивно вызовемся от каждой из частей. В итоге получим отсортированный массив, так как каждый элемент меньше опорного стоял раньше каждого большего опорного.
Асимптотика: O(nlogn) в среднем и лучшем случае, O(n2). Наихудшая оценка достигается при неудачном выборе опорного элемента. Моя реализация этого алгоритма совершенно стандартна,
идем одновременно слева и справа, находим пару элементов, таких, что левый элемент больше опорного, а правый меньше, и меняем их местами. Помимо чистой быстрой сортировки, участвовала в сравнении и сортировка,
переходящая при малом количестве элементов на сортировку вставками. Константа подобрана тестированием, а сортировка вставками — наилучшая сортировка, подходящая для этой задачи (хотя не стоит из-за этого думать,
что она самая быстрая из квадратичных).
*/
#include <stdio.h>
void ft_swap(int *a, int *b)
{
	int helper;
	helper = 0;
	helper = *a;
	*a = *b;
	*b = helper;
}
void printarr(int *arr, int size)
{
	int i;
	for (i=0; i < size; i++) 
		printf("%d ", arr[i]); 
    printf("\n");
}

void quicksort(int *arr, int n)
{
	
}